In [78]:
import pandas as pd
import numpy as np

df = pd.read_csv("pandas_exam_data.csv")
df

    姓名    年龄      工资  部门
0   张三  23.0  5000.0  财务
1   李四  45.0  8000.0  技术
2   王五  31.0  6200.0  技术
3   赵六   NaN  7100.0  人事
4   钱七  22.0     NaN  财务
5   李四  45.0  8000.0  技术
6  NaN  30.0  6700.0  人事

In [54]:
# dir(df)
df.to_csv("processed_exam_data.csv", index=False)

In [75]:
# df = df.drop_duplicates().dropna()
# print(df['姓名'].count())
# df

len(df)

7

In [73]:
df.loc[df['工资'].between(6000, 8000)]

    姓名    年龄      工资  部门
1   李四  45.0  8000.0  技术
2   王五  31.0  6200.0  技术
3   赵六   NaN  7100.0  人事
5   李四  45.0  8000.0  技术
6  NaN  30.0  6700.0  人事

In [40]:
df['收入归类'] = np.where(df['工资']>7000,"高收入","一般")
df

    姓名    年龄      工资  部门 收入归类
0   张三  23.0  5000.0  财务   一般
1   李四  45.0  8000.0  技术  高收入
2   王五  31.0  6200.0  技术   一般
3   赵六   NaN  7100.0  人事  高收入
4   钱七  22.0     NaN  财务   一般
5   李四  45.0  8000.0  技术  高收入
6  NaN  30.0  6700.0  人事   一般

In [36]:
df.groupby('部门').value_counts()

部门  姓名  年龄    工资
技术  李四  45.0  8000.0    2
    王五  31.0  6200.0    1
财务  张三  23.0  5000.0    1
Name: count, dtype: int64

In [69]:
df['年龄组']=pd.cut(df['年龄'], bins=[0,25,35,50],labels=['青年','中年','中老年'])
df

    姓名    年龄      工资  部门  年龄组
0   张三  23.0  5000.0  财务   青年
1   李四  45.0  8000.0  技术  中老年
2   王五  31.0  6200.0  技术   中年
3   赵六   NaN  7100.0  人事  NaN
4   钱七  22.0     NaN  财务   青年
5   李四  45.0  8000.0  技术  中老年
6  NaN  30.0  6700.0  人事   中年

In [70]:
# df.groupby('部门').groups
df.groupby('部门').agg({'工资':'mean', '部门': 'count'})
# df.groupby('部门').count()
# print(df.groupby('部门').count())

    姓名  年龄  工资  年龄组
部门
人事   1   1   2    1
技术   3   3   3    3
财务   2   2   1    2

In [27]:
print("总和工资",df['工资'].sum())
print("平均工资",df['工资'].mean())
print("工资方差",df['工资'].std())

总和工资 41000.0
平均工资 6833.333333333333
工资方差 1146.5891446663302

In [83]:
df['年龄'] = df['年龄'].ffill().astype(int)
df

    姓名  年龄      工资  部门
0   张三  23  5000.0  财务
1   李四  45  8000.0  技术
2   王五  31  6200.0  技术
3   赵六  31  7100.0  人事
4   钱七  22     NaN  财务
5   李四  45  8000.0  技术
6  NaN  30  6700.0  人事

In [20]:
df.duplicated()

df = df.drop(columns='姓名')
df

     年龄      工资  部门
0  23.0  5000.0  财务
1  45.0  8000.0  技术
2  31.0  6200.0  技术
3   NaN  7100.0  人事
4  22.0     NaN  财务
5  45.0  8000.0  技术
6  30.0  6700.0  人事

In [79]:
df['工资'].fillna(df['工资'].mean())
df

    姓名    年龄      工资  部门
0   张三  23.0  5000.0  财务
1   李四  45.0  8000.0  技术
2   王五  31.0  6200.0  技术
3   赵六   NaN  7100.0  人事
4   钱七  22.0     NaN  财务
5   李四  45.0  8000.0  技术
6  NaN  30.0  6700.0  人事

In [3]:
df.isnull()
df = df.dropna()
df

   姓名    年龄      工资  部门
0  张三  23.0  5000.0  财务
1  李四  45.0  8000.0  技术
2  王五  31.0  6200.0  技术
5  李四  45.0  8000.0  技术